// app\static\js\faculty_majorData.js
const majorsData = {
  "ทั้งหมด":["ทั้งหมด"],
  "คณะนิติศาสตร์": [
    "นิติศาสตรบัณฑิต (ท่าพระจันทร์)",
    "นิติศาสตรบัณฑิต (ศูนย์รังสิต)",
    "นิติศาสตรบัณฑิต (ศูนย์ลำปาง)",
    "นิติศาสตรบัณฑิต สาขาวิชากฎหมายธุรกิจ (นานาชาติ)"
  ],

  "คณะพาณิชยศาสตร์และการบัญชี": [
    "บัญชีบัณฑิต",
    "บัญชีบัณฑิต (นานาชาติ)",
    "บริหารธุรกิจบัณฑิต วิชาเอกการเงิน",
    "บริหารธุรกิจบัณฑิต วิชาเอกการตลาด",
    "บริหารธุรกิจบัณฑิต วิชาเอกการบริหารองค์การการประกอบการและทรัพยากรมนุษย์",
    "บริหารธุรกิจบัณฑิต วิชาเอกบริหารการปฏิบัติการ",
    "บริหารธุรกิจบัณฑิต วิชาเอกบริหารธุรกิจระหว่างประเทศ โลจิสติกส์และการขนส่ง",
    "บริหารธุรกิจบัณฑิต วิชาเอกระบบสารสนเทศเพื่อการจัดการ",
    "บริหารธุรกิจบัณฑิต วิชาเอกธุรกิจอสังหาริมทรัพย์",
    "บริหารธุรกิจบัณฑิต วิชาเอกการเงิน (นานาชาติ)",
    "บริหารธุรกิจบัณฑิต วิชาเอกการตลาด (นานาชาติ)",
    "ควบบัญชีบัณฑิต สาขาวิชาการบัญชีธุรกิจแบบบูรณาการ",
    "ควบบริหารธุรกิจบัณฑิต  สาขาวิชาการจัดการธุรกิจแบบบูรณาการ (นานาชาติ)"
  ],

  "คณะรัฐศาสตร์": [
    "รัฐศาสตรบัณฑิต วิชาเอกการเมืองการปกครอง",
    "รัฐศาสตรบัณฑิต วิชาเอกบริหารรัฐกิจ",
    "รัฐศาสตรบัณฑิต วิชาเอกการระหว่างประเทศ",
    "รัฐศาสตรบัณฑิต สาขาวิชาการเมืองและการระหว่างประเทศ (นานาชาติ)"
  ],

  "คณะเศรษฐศาสตร์": [
    "เศรษฐศาสตรบัณฑิต",
    "เศรษฐศาสตรบัณฑิต (นานาชาติ)"
  ],

  "คณะสังคมสงเคราะห์ศาสตร์": [
    "สังคมสงเคราะห์ศาสตรบัณฑิต (ศูนย์รังสิต)",
    "สังคมสงเคราะห์ศาสตรบัณฑิต (ศูนย์ลำปาง)",
    "ศิลปศาสตรบัณฑิต สาขาวิชานโยบายสังคมและการพัฒนา (นานาชาติ)",
    "ศิลปศาสตรบัณฑิต สาขาวิชานโยบายสังคมและการพัฒนา"
  ],

  "คณะวารสารศาสตร์และสื่อสารมวลชน": [
    "วารสารศาสตรบัณฑิต",
    "วารสารศาสตรบัณฑิต สาขาวิชาสื่อศึกษา (นานาชาติ)"
  ],

  "คณะสังคมวิทยาและมานุษยวิทยา": [
    "สังคมวิทยาและมานุษยวิทยาบัณฑิต สาขาวิชาสังคมวิทยาและมานุษยวิทยา",
    "สังคมวิทยาและมานุษยวิทยาบัณฑิต สาขาวิชาการวิจัยทางสังคม"
  ],

  "วิทยาลัยพัฒนศาสตร์ป๋วย อึ๊งภากรณ์": [
    "ศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการพัฒนามนุษย์และสังคม"
  ],

  "วิทยาลัยนวัตกรรม": [
    "ศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (นานาชาติ)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์",
    "วิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทางดิจิทัล"
  ],

  "วิทยาลัยสหวิทยาการ": [
    "ศิลปศาสตรบัณฑิต สาขาวิชาสหวิทยาการ (ศูนย์ลำปาง)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาปรัชญาการเมือง และเศรษฐศาสตร์ (ท่าพระจันทร์)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาปรัชญาการเมือง และเศรษฐศาสตร์ (ศูนย์ลำปาง)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์ และนวัตกรรมข้อมูล",
    "ศิลปศาสตรบัณฑิต สาขาวิชา ปรัชญา การเมือง และเศรษฐศาสตร์ (นานาชาติ)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาสหวิทยาการ (ศูนย์รังสิต)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาการจัดการ เพื่อความยั่งยืน"
  ],

  "วิทยาลัยนานาชาติปรีดีพนมยงค์": [
    "ศิลปศาสตรบัณฑิต สาขาวิชาจีนศึกษา (นานาชาติ)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาไทยศึกษา (นานาชาติ)"
  ],

  "คณะวิทยาการเรียนรู้และศึกษาศาสตร์": [
    "ศิลปศาสตรบัณฑิต สาขาวิชาวิทยาการเรียนรู้",
    "ศิลปศาสตรบัณฑิต สาขาวิชาศักยภาพ มนุษย์และสุขภาวะ"
  ],

  "วิทยาลัยโลกคดีศึกษา": [
    "ศิลปศาสตรบัณฑิต สาขาวิชาโลกคดีศึกษาและการประกอบการสังคม (นานาชาติ)"
  ],

  "คณะศิลปศาสตร์": [
    "วิทยาศาสตรบัณฑิต สาขาวิชาจิตวิทยา",
    "ศิลปศาสตรบัณฑิต วิชาเอกบรรณารักษศาสตร์และสารสนเทศศาสตร์",
    "ศิลปศาสตรบัณฑิต วิชาเอกประวัติศาสตร์",
    "ศิลปศาสตรบัณฑิต วิชาเอกปรัชญา",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษาศาสตร์",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษาและวรรณคดีอังกฤษ",
    "ศิลปศาสตรบัณฑิต วิชาเอกสเปนและลาตินอเมริกันศึกษา",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษาฝรั่งเศส",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษาเยอรมัน",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษารัสเซีย",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษาและวัฒนธรรมจีน",
    "ศิลปศาสตรบัณฑิต วิชาเอกภาษาญี่ปุ่น",
    "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาอังกฤษ",
    "ศิลปศาสตรบัณฑิต สาขาวิชาภาษาไทย",
    "วิทยาศาสตรบัณฑิต สาขาวิชาภูมิศาสตร์และภูมิสารสนเทศ",
    "ศิลปศาสตรบัณฑิต สาขาวิชาอาณาบริเวณศึกษา วิชาเอกเอเชียตะวันออกเฉียงใต้ศึกษา",
    "ศิลปศาสตรบัณฑิต สาขาวิชาอาณาบริเวณศึกษา วิชาเอกรัสเซียและยูเรเชียศึกษา",
    "ศิลปศาสตรบัณฑิต สาขาวิชาอาณาบริเวณศึกษา วิชาเอกเกาหลีศึกษา",
    "ศิลปศาสตรบัณฑิต สาขาวิชาอังกฤษ-อเมริกันศึกษา (นานาชาติ)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาการสื่อสาร เชิงธุรกิจ (นานาชาติ)",
    "ศิลปศาสตรบัณฑิต สาขาวิชาการแปล และล่ามในยุคดิจิทัล"
  ],

  "คณะศิลปกรรมศาสตร์": [
    "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาการละคอน",
    "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาศิลปะการออกแบบพัสตราภรณ์",
    "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาออกแบบหัตถอุตสาหกรรม",
    "ศิลปกรรมศาสตรบัณฑิต สาขาวิชาการบริหารจัดการศิลปะ",
    "ศิลปกรรมศาสตรบัณฑิต สาขาวิชา ออกแบบหัตถอุตสาหกรรมสร้างสรรค์"
  ],

  "คณะวิทยาศาสตร์และเทคโนโลยี": [
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม",
    "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเพื่อการพัฒนายั่งยืน",
    "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการเกษตร",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์",
    "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์",
    "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์",
    "วิทยาศาสตรบัณฑิต สาขาวิชาสถิติ",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีการอาหาร",
    "วิทยาศาสตรบัณฑิต สาขาวิชาเคมี",
    "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีชีวภาพ",
    "วิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์",
    "วิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์ อิเล็กทรอนิกส์",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวัสดุศาสตร์",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งทอ",
    "วิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์การจัดการ",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการประกันภัย",
    "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีพลังงานชีวภาพและการแปรรูปเคมีชีวภาพ",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และนวัตกรรมทางอาหาร",
    "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีและนวัตกรรมดิจิทัล",
    "วิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์เครือข่ายและความปลอดภัยทางไซเบอร์"
  ],

  "คณะวิศวกรรมศาสตร์": [
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมซอฟต์แวร์",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการบริหารการก่อสร้าง",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าและการจัดการอุตสาหกรรม",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมยานยนต์และระบบอัตโนมัติ",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าและข้อมูล (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการพัฒนาอสังหาริมทรัพย์ (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมีและการจัดการ (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกลและการจัดการอุตสาหกรรม (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (นานาชาติ) (สองสถาบัน)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (นานาชาติ) (สองสถาบัน)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (นานาชาติ) (สองสถาบัน)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (นานาชาติ) (สองสถาบัน)"
  ],

  "คณะสถาปัตยกรรมศาสตร์และการผังเมือง": [
    "วิทยาศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรม",
    "วิทยาศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรมเพื่อการพัฒนาอสังหาริมทรัพย์",
    "การผังเมืองบัณฑิต",
    "ภูมิสถาปัตยกรรมศาสตรบัณฑิต",
    "สถาปัตยกรรมภายในบัณฑิต",
    "วิทยาศาสตรบัณฑิต สาขาวิชาการจัดการออกแบบธุรกิจและเทคโนโลยี (นานาชาติ)"
  ],

  "สถาบันเทคโนโลยีนานาชาติสิรินธร (SIIT)": [
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการและโลจิสติกส์อัจฉริยะ (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (นานาชาติ)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาการวิเคราะห์ธุรกิจและโซ่อุปทาน (นานาชาติ)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาการจัดการวิศวกรรม (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ (นานาชาติ)",
    "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมดิจิทัล (นานาชาติ)"
  ],

  "คณะแพทยศาสตร์": [
    "แพทยศาสตรบัณฑิต",
    "แพทยศาสตรบัณฑิต (ภาษาอังกฤษ)",
    "การแพทย์แผนไทยประยุกต์บัณฑิต (ศูนย์รังสิต)",
    "การแพทย์แผนไทยประยุกต์บัณฑิต (ศูนย์ลำปาง)"
  ],

  "คณะทันตแพทยศาสตร์": [
    "ทันตแพทยศาสตรบัณฑิต",
    "ทันตแพทยศาสตรบัณฑิต (ทวิภาษา)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาทันตสาธารณสุข (ต่อเนื่อง)"
  ],

  "คณะสหเวชศาสตร์": [
    "เทคนิคการแพทยบัณฑิต",
    "วิทยาศาสตรบัณฑิต สาขาวิชากายภาพบำบัด",
    "วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์การกีฬาและการออกกำลังกาย",
    "ศิลปศาสตรบัณฑิต สาขาวิชาการจัดการกีฬา",
    "ศิลปศาสตรบัณฑิต สาขาวิชาการฝึกสอนกีฬา",
    "วิทยาศาสตรบัณฑิต สาขาวิชารังสีเทคนิค"
  ],

    "คณะพยาบาลศาสตร์": [
    "พยาบาลศาสตรบัณฑิต"
  ],

  "คณะสาธารณสุขศาสตร์": [
    "วิทยาศาสตรบัณฑิต สาขาวิชาการสร้างเสริมสุขภาพเชิงนวัตกรรม",
    "วิทยาศาสตรบัณฑิต สาขาวิชาอาชีวอนามัยและความปลอดภัย (ศูนย์รังสิต)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาอาชีวอนามัยและความปลอดภัย (ศูนย์ลำปาง)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาอนามัยสิ่งแวดล้อม (ศูนย์รังสิต)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาอนามัยสิ่งแวดล้อม (ศูนย์ลำปาง)",
    "วิทยาศาสตรบัณฑิต สาขาวิชาอนามัยชุมชน"
    ],

  "คณะเภสัชศาสตร์": [
    "เภสัชศาสตรบัณฑิต"
  ],


  "วิทยาลัยแพทยศาสตร์นานาชาติจุฬาภรณ์": [
    "วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีหัวใจและทรวงอก (นานาชาติ)",
    "การแพทย์แผนจีนบัณฑิต (นานาชาติ)",
    "แพทยศาสตรบัณฑิต และวิทยาศาสตรบัณฑิตสาขาวิชาวิทยาศาสตร์การแพทย์ (นานาชาติ)",
    "ทัศนมาตรศาสตรบัณฑิต (นานาชาติ)"

  ],


};